arribada/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
/**
 * @file lora_rak3172.cpp
 * @brief LoRa RAK3172-SiP device driver — state machine, TX, join, config.
 */

#include "lora_rak3172.hpp"
#include "lora_rak3172_comm.hpp"
#include "bsp.hpp"
#include "gpio.hpp"
#include "pmu.hpp"
#include "debug.hpp"
#include "error.hpp"
#include "binascii.hpp"
#include "config_store.hpp"
#include "nrf_gpio.h"
#include <cstdint>
#include <string>

// Park unused satellite-slot pins in high-impedance on the LoRa board variant:
//   - SAT_INT (P0.29): BSP default has INPUT_CONNECT (input buffer ON). On the
//     LoRa PCB this pin is not wired to anything the RAK3172 drives, so the
//     enabled buffer floats and leaks through the Schmitt trigger. Switch to
//     INPUT_DISCONNECT.
//   - SAT_EXTWAKEUP (P0.30): not connected on LoRa. BSP leaves it as an output;
//     driving an unconnected pin is 0 A but toggling during state changes is
//     wasted bus activity. Park as INPUT_DISCONNECT.
//   - SAT_RESET (P0.31): BSP already sets INPUT_DISCONNECT for probe flashing,
//     which coincidentally is also the lowest-leakage config — leave as is.
//   - SAT_PWR_EN (P1.15): THE one pin we keep actively driving (module power).
//   - KIM_PWR_ON (P0.5): legacy KIM2 power-enable pin, never used in LoRa code.
//     BSP leaves it as OUTPUT (default LOW after reset). If the LoRa PCB
//     physically routes this pin to a RAK3172-SiP GPIO that has an internal
//     pull-up enabled by RUI3 firmware, ~80 µA leaks: RAK VDD → pull-up →
//     pin → nRF P0.5 (LOW) → GND. Parking as INPUT_DISCONNECT breaks the
//     current path. Hypothesis to validate: standby ~130 µA → ~50 µA after
//     this fix.
static inline void lora_park_unused_sat_pins()
{
    nrf_gpio_cfg(NRF_GPIO_PIN_MAP(0, 29),   // SAT_INT
                 NRF_GPIO_PIN_DIR_INPUT,
                 NRF_GPIO_PIN_INPUT_DISCONNECT,
                 NRF_GPIO_PIN_NOPULL,
                 NRF_GPIO_PIN_S0S1,
                 NRF_GPIO_PIN_NOSENSE);
    nrf_gpio_cfg(NRF_GPIO_PIN_MAP(0, 30),   // SAT_EXTWAKEUP
                 NRF_GPIO_PIN_DIR_INPUT,
                 NRF_GPIO_PIN_INPUT_DISCONNECT,
                 NRF_GPIO_PIN_NOPULL,
                 NRF_GPIO_PIN_S0S1,
                 NRF_GPIO_PIN_NOSENSE);
    nrf_gpio_cfg(NRF_GPIO_PIN_MAP(0, 5),    // KIM_PWR_ON (unused on LoRa)
                 NRF_GPIO_PIN_DIR_INPUT,
                 NRF_GPIO_PIN_INPUT_DISCONNECT,
                 NRF_GPIO_PIN_NOPULL,
                 NRF_GPIO_PIN_S0S1,
                 NRF_GPIO_PIN_NOSENSE);
}

using namespace LoRa;

#define LORA_STATE_CHANGE(x, y)                                 \
    do {                                                        \
        DEBUG_TRACE("LoRa::STATE_CHANGE: " #x " -> " #y);      \
        m_state = State::y;                                     \
        state_ ## x ##_exit();                                  \
        state_ ## y ##_enter();                                 \
        run_state_machine();                                    \
    } while (0)

#define LORA_STATE_EQUAL(x) \
    (m_state == State::x)

#define LORA_STATE_CALL(x) \
    do {                   \
        state_ ## x();     \
    } while (0)

extern Scheduler *system_scheduler;
extern ConfigurationStore *configuration_store;

// ============================================================================
// TODO / WARNING — Power consumption when LoRa service is NOT used at runtime
// ============================================================================
// The constructor below immediately kicks the state machine from power_off →
// power_on. This means the RAK3172 module is BOOTED, CONFIGURED, and (in OTAA)
// JOINED **unconditionally** as soon as the LoRaDevice is instantiated, even
// when the LoRaTxService is disabled at runtime (e.g. ARGOS_MODE = OFF or any
// configuration where service_is_enabled() returns false and service_initiate()
// is never called).
//
// Observed symptom (measured 13/05/2026, LinkIt V4 LoRa, PPK) :
//   - LoRa service ENABLED  (Argos Doppler / surface burst running) :
//       inter-cycle idle ~25 µA  (RAK3172 cleanly in Stop2 standby ~1.7 µA,
//       UARTE1 deinit'd, all paths optimised)
//   - LoRa service DISABLED (ARGOS_MODE = OFF, no service ever runs) :
//       inter-cycle idle ~150 µA (RAK3172 sits in `idle` after configure with
//       UARTE1 still init'd; nobody ever transitions it to standby because
//       state_idle → standby fires only after a TX cycle. ~120 µA wasted.)
//
// Why it works in production : every field deployment has at least one TX mode
// active, so the service eventually fires a TX → state_transmit → state_idle
// → state_standby chain, and the module settles in Stop2 (1.7 µA). The wasted
// current only shows up in bench tests with the LoRa stack disabled but the
// module compiled in.
//
// Fix idea (not done — low priority, doesn't impact field deployments) :
//   - On boot, defer the power_on transition until either:
//       a) service_initiate() is first called (lazy init), or
//       b) write_credentials_from_config() / read_lora_credentials() is invoked
//          (covers the SATVF / DTE diagnostic paths)
//   - Alternatively, post a one-shot "if no TX scheduled within 30 s, transit
//     to power_off" task at boot.
//
// Until that refactor, accept that bench tests with LoRa disabled show ~120 µA
// extra idle conso. This is a TEST-ONLY artefact, not a field issue.
// ============================================================================
LoRaDevice::LoRaDevice()
{
    m_packet_buffer.clear();
    m_join_attempted = false;
    m_join_wait_ticks = 0;
    m_state = State::power_off;
    m_joined = false;
    m_join_failed = false;
    m_tx_done = false;
    m_config_step = 0;
    m_is_configured = false;
    m_power_on_retry = 0;
    m_nwm_reboot_pending = false;
    m_consecutive_errors = 0;
    m_config_reload_pending = false;
    load_config_from_store();
    LORA_STATE_CHANGE(power_off, power_on);
}

LoRaDevice::~LoRaDevice()
{
    stop_bridge();
    power_off_immediate();
}

