arribada/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
bool LoRaDevice::start_bridge(LoRaComm::PassthroughCallback rx_callback)
{
    if (m_bridge_active)
        return true;

    // Cancel any pending state machine task
    cancel_timeout();
    system_scheduler->cancel_task(m_task);

    // Ensure UART is initialized
    m_lora_comm.init();

    // Enable passthrough: raw UART RX goes to callback
    m_lora_comm.set_passthrough(true, rx_callback);
    m_bridge_active = true;

    DEBUG_INFO("LoRaDevice: bridge mode ACTIVE");
    return true;
}

void LoRaDevice::stop_bridge()
{
    if (!m_bridge_active)
        return;

    m_lora_comm.set_passthrough(false);
    m_bridge_active = false;

    DEBUG_INFO("LoRaDevice: bridge mode STOPPED");

    // Restart state machine from current state
    run_state_machine();
}

bool LoRaDevice::bridge_send(const uint8_t* data, size_t len)
{
    if (!m_bridge_active)
        return false;
    return m_lora_comm.send_raw_data(data, len);
}

void LoRaDevice::bridge_process_rx()
{
    if (m_bridge_active)
        m_lora_comm.process_rx();
}

/**
 * Send a packet via LoRaWAN.
 *
 * The modulation parameter is ignored (LoRa uses its own DR settings).
 * The packet data is hex-encoded and sent on the configured FPort.
 */
void LoRaDevice::send(const KineisModulation mode, const KineisPacket& user_payload, const unsigned int payload_length)
{
    (void)mode;  // LoRa handles modulation via DR setting

    // Reject if already transmitting to avoid overwriting in-flight packet
    if (m_state == State::transmit) {
        DEBUG_WARN("LoRaDevice::send: already transmitting, ignoring");
        return;
    }

    // Defense in depth: reject oversized payloads before handing to the module.
    // Service layer should already clamp to LoRaPayloadLimits::max_payload_for_dr,
    // but a stale config cache or programming error must not be able to wedge the
    // module with an AT_PARAM_ERROR that falls through the error retry path.
    unsigned int payload_bytes = (payload_length + 7) / 8;
    static constexpr unsigned int dr_limits[] = { 51, 51, 51, 115, 222, 222 };
    unsigned int max_bytes = (m_config.dr < 6) ? dr_limits[m_config.dr] : dr_limits[0];
    if (payload_bytes > max_bytes) {
        DEBUG_ERROR("LoRaDevice::send: payload %u bytes > DR%u limit %u — rejecting",
                    payload_bytes, m_config.dr, max_bytes);
        notify(KineisEventDeviceError({}));
        return;
    }

    KineisPacket packet(user_payload.begin(), user_payload.begin() + payload_bytes);
    m_packet_buffer = Binascii::hexlify(packet);
    // New packet, new join budget: state_idle may spend at most one join window
    // on it (see the guard there).
    m_join_attempted = false;

    DEBUG_TRACE("LoRaDevice::send: payload[%u bits]=%s", payload_length, m_packet_buffer.c_str());

    // Request power on (if not already running)
    start_device();
}

void LoRaDevice::stop_send() {
    DEBUG_TRACE("LoRaDevice::stop_send");
    m_packet_buffer.clear();
}

// ========================================================================
// Event handlers from LoRaComm
// ========================================================================

void LoRaDevice::react(const LoRaCommEventRespOk&) {
    m_cmd_is_ok = true;
}

void LoRaDevice::react(const LoRaCommEventRespError& err) {
    DEBUG_INFO("LoRaDevice: error response type=%d", static_cast<int>(err.error_type));
    // AT_NO_NETWORK_JOINED is the module telling us the OTAA session is gone —
    // server-side re-registration, session expiry, or a module-side reset that
    // dropped it. Nothing else in this driver ever clears m_joined (it is only
    // set false on power-on, on entering joining, and on a credential change),
    // so without this the flag stays stale-true for as long as the module stays
    // powered, and the re-join guard in state_idle can never observe the very
    // condition it exists for.
    if (err.error_type == LoRa::RESP_NO_NETWORK)
        m_joined = false;
    m_is_error = true;
}

void LoRaDevice::react(const LoRaCommEventJoined&) {
    DEBUG_INFO("LoRaDevice: JOINED");
    m_joined = true;
}

void LoRaDevice::react(const LoRaCommEventJoinFailed&) {
    DEBUG_INFO("LoRaDevice: JOIN FAILED");
    m_join_failed = true;
}

void LoRaDevice::react(const LoRaCommEventTxDone&) {
    DEBUG_TRACE("LoRaDevice: TX_DONE");
    m_tx_done = true;
}

void LoRaDevice::react(const LoRaCommEventRxData& rx) {
    DEBUG_INFO("LoRaDevice: RX port=%d data=%s", rx.port, rx.payload.c_str());
    // Downlink data received - could be forwarded to a service if needed
}

void LoRaDevice::react(const LoRaCommEventUartError& err) {
    DEBUG_INFO("LoRaDevice: UART error type=%02x", err.error_type);
    m_is_error = true;
}

// ========================================================================
// Timeout management
// ========================================================================

void LoRaDevice::initiate_timeout(unsigned int timeout_ms) {
    cancel_timeout();
    m_timeout.handle = system_scheduler->post_task_prio([this]() {
        on_timeout();
    }, "LoRaTimeout", Scheduler::DEFAULT_PRIORITY, timeout_ms);
}

void LoRaDevice::on_timeout() {
    DEBUG_ERROR("LoRaDevice::on_timeout");
    m_is_error = true;
}

void LoRaDevice::cancel_timeout() {
    system_scheduler->cancel_task(m_timeout.handle);
}

// ========================================================================
// State machine infrastructure
// ========================================================================

void LoRaDevice::start_device()
{
    if (m_state == State::standby) {
        // state_standby_enter deinit'd the nRF UARTE1 for power savings. We
        // MUST reinit it before any AT command — sending on a deinit'd UART
        // silently fails (nrf_libuarte_async_tx no-ops) and leaves
        // m_is_send_busy stuck at true, producing "already busy" on every
        // subsequent call. init() is idempotent (guarded by m_is_init).
        m_lora_comm.init();

        // Quick wake from LPM Stop2 via AT ping (~10ms).
        // RAK3172 wakes on first UART byte, responds to AT within a few ms.
        // Retry up to 3 times before power cycling (module may be slow to wake).
        bool wake_ok = false;
        for (int attempt = 0; attempt < 3 && !wake_ok; attempt++) {
            if (send_AT(AT_TEST))
                wake_ok = true;
        }
        if (wake_ok) {
            DEBUG_TRACE("LoRa: wake from standby OK");
            // Fast path: skip state_idle when a packet is queued and no
            // deferred config reload is pending. Saves one FSM tick
            // (~100 ms, run_state_machine default delay) on the surface
            // first-TX critical path. Mirrors the Argos optimization
            // "skip state_idle on warm-packet path" (§5 priority 3,
            // CLAUDE.md). state_transmit_enter() is robust to entry from
            // any state — it only resets m_tx_done/m_is_error and fires
            // AT+SEND synchronously. The config_reload_pending guard
            // preserves the slow path when a PARMW landed between dive
            // warm-up and surface TX (would otherwise TX with stale config).
            if (m_packet_buffer.length() && !m_config_reload_pending) {
                DEBUG_TRACE("LoRa: standby wake fast-path → transmit (packet queued)");
                LORA_STATE_CHANGE(standby, transmit);
            } else {
                LORA_STATE_CHANGE(standby, idle);
            }
        } else {
            // Module not responding after 3 attempts — full power cycle
            DEBUG_WARN("LoRa: standby wake failed after 3 attempts, power cycling");
            std::string saved_packet = m_packet_buffer;
            power_off_immediate();  // This clears m_packet_buffer
            m_packet_buffer = saved_packet;
            LORA_STATE_CHANGE(power_off, power_on);
        }
        return;
    }

    if (m_state != State::power_off) {
        DEBUG_TRACE("LoRa::start: already running state=%u", static_cast<unsigned>(m_state));
        run_state_machine(0);
        return;
    }
    LORA_STATE_CHANGE(power_off, power_on);
}

void LoRaDevice::power_off_immediate(void)
{
    DEBUG_TRACE("LoRaDevice::power_off_immediate");
    if (!LORA_STATE_EQUAL(power_off)) {
        system_scheduler->cancel_task(m_task);
        cancel_timeout();
        m_state = State::power_off;
        state_power_off_enter();
    }
}

/// @brief Warm up the module for a fast next-TX dispatch. The FSM runs
/// power_on → configure → join → idle → standby asynchronously. State
/// machine is left in standby with empty packet buffer so the next send()
/// goes through the fast wake path (state_standby → start_device reinit
/// UART + AT ping ~10 ms).
void LoRaDevice::warm_up_for_tx()
{
    if (m_state != State::power_off) {
        // Already running — nothing to do. start_device would just log and
        // re-tick the FSM.
        return;
    }
    DEBUG_INFO("LoRaDevice::warm_up_for_tx: pre-booting module for next surface TX");
    LORA_STATE_CHANGE(power_off, power_on);
}

/// @brief Blocking send of an AT command with polling for OK response.
/// @param cmd        AT command type.
/// @param params     Optional parameter string.
/// @param timeout_ms Maximum wait time in ms.
/// @return true on success (OK received), false on error/timeout.
bool LoRaDevice::send_AT(ATCmd cmd, const std::optional<std::string>& params, uint16_t timeout_ms)
{
    m_cmd_is_ok = false;
    m_is_error = false;

