arribada/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
    m_lora_comm.send(cmd, params);

    while (!m_cmd_is_ok && !m_is_error && timeout_ms != 0) {
        PMU::delay_ms(1);
        m_lora_comm.process_rx();
        timeout_ms--;
    }

    if (timeout_ms == 0) {
        // AT_SLEEP_NOW runs on a deliberately short, non-fatal timeout: the
        // RAK3172 may already be in Stop2 or transition into it before
        // emitting OK, and state_standby_enter proceeds with UART deinit
        // either way (wake-on-RX brings it back). Demote to TRACE so we don't
        // spam WARN on every standby cycle; keep WARN for any other command
        // where a missing OK is a real protocol failure.
        if (cmd == AT_SLEEP_NOW)
            DEBUG_TRACE("LoRaDevice::send_AT: AT_SLEEP_NOW no-ack (expected — module entering Stop2)");
        else
            DEBUG_WARN("LoRaDevice::send_AT: timeout (cmd=%d)", static_cast<int>(cmd));
    }

    return m_cmd_is_ok && !m_is_error;
}

void LoRaDevice::state_machine(void)
{
    switch (m_state) {
    case State::power_off:   LORA_STATE_CALL(power_off);  break;
    case State::power_on:    LORA_STATE_CALL(power_on);   break;
    case State::configure:   LORA_STATE_CALL(configure);  break;
    case State::joining:     LORA_STATE_CALL(joining);    break;
    case State::idle:        LORA_STATE_CALL(idle);       break;
    case State::standby:     LORA_STATE_CALL(standby);    break;
    case State::transmit:    LORA_STATE_CALL(transmit);   break;
    case State::error:       LORA_STATE_CALL(error);      break;
    default: break;
    }
}

void LoRaDevice::run_state_machine(uint16_t delay_ms)
{
    system_scheduler->cancel_task(m_task);
    m_task = system_scheduler->post_task_prio([this]() {
        state_machine();
    }, "LoRaStateMachine", Scheduler::DEFAULT_PRIORITY, delay_ms);
}

// ========================================================================
// State: power_off
// ========================================================================

void LoRaDevice::state_power_off_enter()
{
    DEBUG_INFO("LoRaDevice::state_power_off_enter");
    m_lora_comm.deinit();
    GPIOPins::clear(SAT_PWR_EN);
    // Park all non-essential nRF pins that touch (or might touch) the LoRa
    // slot into high-impedance input-disconnect so the board truly draws 0 A
    // through the satellite interface when SAT_PWR_EN is low.
    lora_park_unused_sat_pins();
    m_packet_buffer.clear();
}

void LoRaDevice::state_power_off() {
    ;
}

void LoRaDevice::state_power_off_exit() {
    ;
}

// ========================================================================
// State: power_on
//   - Enable power to module
//   - Init UART at 115200 baud
//   - Wait for module boot
//   - Verify communication with AT ping
// ========================================================================

void LoRaDevice::state_power_on_enter()
{
    GPIOPins::set(SAT_PWR_EN);
    // Park unused SAT_* slot pins in input-disconnect. Runs on every power-on
    // so first-boot (before any power_off_enter has fired) still gets the
    // low-leakage pin config instead of the BSP default (input buffer ON).
    lora_park_unused_sat_pins();
    m_lora_comm.init();  // RAK3172 RUI3 factory default 115200 8N1
    m_lora_comm.subscribe(*this);
    m_joined = false;
    m_join_failed = false;
    m_power_on_retry = 0;
    // Non-blocking: schedule first state_power_on() after module boot delay
}

void LoRaDevice::state_power_on()
{
    // Boot-wait + ping budget (tuned for fast first-TX in ABP):
    //   - Initial wait 1000 ms (was 2000) — RAK3172 RUI3 boots in ~1.2-1.5 s
    //     typical, so the first ping may fail on cold/slow boots; the retry
    //     loop below covers that.
    //   - AT_TEST per-attempt timeout 400 ms (was 2000) — AT_TEST is a 4-byte
    //     command; a healthy RAK answers in <50 ms. Tight timeout makes the
    //     retry mechanism react fast when the module isn't ready yet.
    //   - 8 retries at 300 ms gap (was 4 at 500 ms) — total ping window is
    //     1000 + 7*(400+300) ≈ 5.9 s, similar to the old worst case (~11 s
    //     thanks to old 2 s timeouts) but converges in ~1.1 s in the nominal
    //     case (saves ~1 s on every cold boot vs the old 2.1 s minimum).
    if (m_power_on_retry == 0) {
        // First call: wait for RAK3172 boot (typically ~1.2 s)
        m_power_on_retry = 1;
        run_state_machine(1000);
        return;
    }

    // Drain boot banner / noise before the first AT ping. The RAK3172 prints a
    // welcome banner at power-on which would otherwise trigger a spurious
    // framing error and confuse the next send_AT's polling loop.
    if (m_power_on_retry == 1)
        m_lora_comm.process_rx();

    DEBUG_TRACE("LoRaDevice::state_power_on retry=%u", m_power_on_retry);

    // Try AT ping with tight per-attempt timeout (default 2000 ms is way too
    // generous for AT_TEST — it just blocks the FSM when the module is silent).
    if (send_AT(AT_TEST, std::nullopt, 400))
    {
        DEBUG_TRACE("LoRaDevice: AT ping OK (attempt %u)", m_power_on_retry);
        LORA_STATE_CHANGE(power_on, configure);
        return;
    }

    if (m_power_on_retry < 8) {
        m_power_on_retry++;
        run_state_machine(300);  // Tighter retry gap
        return;
    }

    DEBUG_ERROR("LoRaDevice: AT ping failed after %u attempts — check wiring/module", m_power_on_retry);
    LORA_STATE_CHANGE(power_on, error);
}

void LoRaDevice::state_power_on_exit() {
    ;
}

// ========================================================================
// State: configure
//   - First boot: full configuration (all LoRaWAN parameters via AT commands)
//   - Subsequent boots: fast path — RAK3172 persists config to flash,
//     so we only read DEVEUI and check join status
// ========================================================================

void LoRaDevice::state_configure_enter()
{
    m_nwm_reboot_pending = false;
    if (m_is_configured) {
        // Fast path: RAK3172 persists config to flash, skip to DEVEUI read + join check
        m_config_step = 100;
        DEBUG_INFO("LoRaDevice: fast config (module already configured)");
    } else {
        m_config_step = 0;
        DEBUG_INFO("LoRaDevice: full config (first boot)");
    }
}

void LoRaDevice::state_configure()
{
    DEBUG_TRACE("LoRaDevice::state_configure step=%u", m_config_step);
    bool at_error = false;

    switch (m_config_step)
    {
        // ==== Full configuration (first boot only) ====

        case 0:
        {
            // Ensure LoRaWAN network mode (AT+NWM=1)
            if (m_nwm_reboot_pending) {
                m_nwm_reboot_pending = false;
                at_error = !send_AT(AT_TEST);
                if (at_error) {
                    DEBUG_ERROR("LoRaDevice: module not responding after NWM reboot");
                }
                break;
            }
            at_error = !send_AT(AT_GET_NWM);
            if (!at_error && m_lora_comm.m_last_value == "1") {
                DEBUG_TRACE("LoRaDevice: already in LoRaWAN mode");
                break;
            }
            DEBUG_INFO("LoRaDevice: setting NWM=1 (module will reboot)");
            if (!m_lora_comm.send(AT_SET_NWM, "1")) {
                DEBUG_ERROR("LoRaDevice: failed to issue AT+NWM=1 (UART busy/deinit)");
                at_error = true;
                break;
            }
            m_nwm_reboot_pending = true;
            run_state_machine(3000);  // Wait for module autoreboot after NWM change
            return;
        }

        case 1:
            // Set join mode (OTAA or ABP)
            at_error = !send_AT(AT_SET_NJM, std::to_string(m_config.njm));
            break;

