arribada/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
        case 2:
            // Set frequency band
            at_error = !send_AT(AT_SET_BAND, std::to_string(m_config.band));
            break;

        case 3:
            // Set Device EUI. Only relevant for OTAA — ABP activation uses
            // DEVADDR + NWKSKEY + APPSKEY (written at step 5). RAK3172 rejects
            // AT+DEVEUI writes in certain ABP states with PARAM_ERROR type=2.
            if (m_config.njm == 0) {
                DEBUG_TRACE("LoRaDevice: ABP mode — skipping DEVEUI set");
                break;
            }
            if (m_config.deveui.empty()) {
                at_error = !send_AT(AT_GET_DEVEUI);
                if (!at_error && !m_lora_comm.m_last_value.empty() &&
                    m_lora_comm.m_last_value != "0000000000000000") {
                    m_config.deveui = m_lora_comm.m_last_value;
                    DEBUG_INFO("LoRaDevice: module DEVEUI=%s", m_config.deveui.c_str());
                } else {
                    // Generate from nRF52840 FICR unique device ID
                    char buf[17];
#ifdef NRF52840_XXAA
                    snprintf(buf, sizeof(buf), "%08lX%08lX",
                             (unsigned long)NRF_FICR->DEVICEID[1],
                             (unsigned long)NRF_FICR->DEVICEID[0]);
#else
                    snprintf(buf, sizeof(buf), "%08lX%08lX",
                             (unsigned long)0, (unsigned long)PMU::device_identifier());
#endif
                    m_config.deveui = std::string(buf);
                    DEBUG_INFO("LoRaDevice: generated DEVEUI=%s", m_config.deveui.c_str());
                    at_error = !send_AT(AT_SET_DEVEUI, m_config.deveui);
                }
                // Persist to config store so user can read via PARMR (LRP01)
                configuration_store->write_param(ParamID::LORA_DEVEUI, m_config.deveui);
            } else {
                at_error = !send_AT(AT_SET_DEVEUI, m_config.deveui);
            }
            break;

        case 4:
            // Set Application EUI (OTAA only)
            if (m_config.njm == 1) {
                if (m_config.appeui.empty()) {
                    // Was a silent skip: the module then joined with whatever
                    // APPEUI sat in its own flash. Say so, loudly.
                    DEBUG_ERROR("LoRaDevice: LORA_APPEUI (LRP02) is UNSET — module keeps its stored JoinEUI");
                    break;
                }
                if (m_config.appeui.size() != 16) {
                    DEBUG_ERROR("LoRaDevice: invalid APPEUI length %u (expected 16 hex chars)", static_cast<unsigned>(m_config.appeui.size()));
                    at_error = true;
                    break;
                }
                at_error = !send_AT(AT_SET_APPEUI, m_config.appeui);
                if (!at_error)
                    DEBUG_INFO("LoRaDevice: APPEUI written to module (%s)", m_config.appeui.c_str());
            }
            break;

        case 5:
            // Set Application Key (OTAA) or session keys (ABP)
            if (m_config.njm == 1) {
                if (m_config.appkey.empty()) {
                    // Same silent-skip trap as APPEUI, and the more damaging of
                    // the two: a wrong AppKey fails the server-side MIC check,
                    // so the JoinRequest is discarded without any reply at all.
                    DEBUG_ERROR("LoRaDevice: LORA_APPKEY (LRP03) is UNSET — module keeps its stored AppKey; "
                                "the server will drop the JoinRequest on MIC");
                    break;
                }
                if (m_config.appkey.size() != 32) {
                    DEBUG_ERROR("LoRaDevice: invalid APPKEY length %u (expected 32 hex chars)", static_cast<unsigned>(m_config.appkey.size()));
                    at_error = true;
                    break;
                }
                at_error = !send_AT(AT_SET_APPKEY, m_config.appkey);
                if (!at_error)
                    DEBUG_INFO("LoRaDevice: APPKEY written to module (32 hex chars, not logged)");
            } else if (m_config.njm == 0) {
                if (!m_config.devaddr.empty()) {
                    if (m_config.devaddr.size() != 8) {
                        DEBUG_ERROR("LoRaDevice: invalid DEVADDR length %u (expected 8 hex chars)", static_cast<unsigned>(m_config.devaddr.size()));
                        at_error = true;
                        break;
                    }
                    at_error = !send_AT(AT_SET_DEVADDR, m_config.devaddr);
                }
                if (!at_error && !m_config.nwkskey.empty()) {
                    if (m_config.nwkskey.size() != 32) {
                        DEBUG_ERROR("LoRaDevice: invalid NWKSKEY length %u (expected 32 hex chars)", static_cast<unsigned>(m_config.nwkskey.size()));
                        at_error = true;
                        break;
                    }
                    at_error = !send_AT(AT_SET_NWKSKEY, m_config.nwkskey);
                }
                if (!at_error && !m_config.appskey.empty()) {
                    if (m_config.appskey.size() != 32) {
                        DEBUG_ERROR("LoRaDevice: invalid APPSKEY length %u (expected 32 hex chars)", static_cast<unsigned>(m_config.appskey.size()));
                        at_error = true;
                        break;
                    }
                    at_error = !send_AT(AT_SET_APPSKEY, m_config.appskey);
                }
            }
            break;

        case 6:
            // Set device class (AT+CLASS=A/B/C)
            at_error = !send_AT(AT_SET_CLASS, std::string(1, static_cast<char>(m_config.device_class)));
            break;

        case 7:
            // Set data rate
            at_error = !send_AT(AT_SET_DR, std::to_string(m_config.dr));
            break;

        case 8:
            // Set ADR
            at_error = !send_AT(AT_SET_ADR, std::to_string(m_config.adr));
            break;

        case 9:
            // Set TX power
            at_error = !send_AT(AT_SET_TXP, std::to_string(m_config.txp));
            break;

        case 10:
            // Set confirmed/unconfirmed mode
            at_error = !send_AT(AT_SET_CFM, std::to_string(m_config.cfm));
            break;

        case 11:
            // Set retry count (only relevant if CFM=1)
            if (m_config.cfm) {
                at_error = !send_AT(AT_SET_RETY, std::to_string(LoRa::DEFAULT_RETY));
            }
            break;

