arribada/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
        case 12:
            // Apply user-configured low-power mode (LORA_LP_MODE / LRP15):
            //   0 = shutdown (0 µA idle, ~2.5 s reboot on next TX)
            //   1 = standby Stop2 (~1.7 µA idle, ~10 ms wake)
            at_error = !send_AT(AT_SET_LPM, std::to_string(m_config.lp_mode));
            break;

        case 13:
            // Select the deepest sleep level compatible with our hardware.
            //
            // The LinkIt V4 LoRa PCB routes the AT-command UART to the RAK3172
            // *UART1* pins (STM32 USART1 = PA9/PA10) — see bsp.cpp:360-361.
            //
            // Per the RUI3 AT manual: "Stop2 Mode ... will not allow you to
            // wake up using UART1. On Stop1 Mode, both UART1 and UART2 can
            // wake up the device." So LPMLVL=2 is incompatible with this PCB
            // — the module enters Stop2 but cannot be woken via our UART,
            // and RUI3's fallback (RTC-wake duty cycle) results in ~130 µA
            // observed instead of the datasheet 1.7 µA.
            //
            // LPMLVL=1 (Stop1) supports UART1 wake and gives ~3 µA per
            // STM32WLE5 datasheet — acceptable for our use case (turtle tag
            // burst gaps of 30+ s).
            //
            // Tolerated as non-fatal: older RUI3 firmware versions (pre 4.0.x)
            // don't support AT+LPMLVL at all and return ERROR. In that case
            // AT+LPM=1 (set in step 12) is the best we can do — the module
            // uses its default sleep level. Don't fail the whole configure
            // walk over a missing optional optimisation.
            if (!send_AT(AT_SET_LPMLVL, std::to_string(1))) {
                DEBUG_WARN("LoRaDevice: AT+LPMLVL not supported by this RUI3 version — continuing with LPM=1 default");
            }

            // Belt-and-suspenders verification: query LPM mode + level back from
            // the module so we know what sleep state it will actually enter at
            // idle. Pure diagnostic — failures don't fail the configure walk,
            // they just leave "?" in the log. The only ground truth for sleep
            // current is still an ammeter on SAT_PWR_EN (~3 µA at Stop1, ~400 µA
            // if auto-sleep is off), but a matching LPM=1 + LPMLVL=1 readback is
            // strong indirect evidence that the RAK accepted and applied the
            // commands. Runs once per cold boot, not per standby cycle.
            {
                std::string lpm_val = "?";
                std::string lpmlvl_val = "?";
                if (send_AT(AT_GET_LPM))
                    lpm_val = m_lora_comm.m_last_value;
                if (send_AT(AT_GET_LPMLVL))
                    lpmlvl_val = m_lora_comm.m_last_value;
                DEBUG_INFO("LoRaDevice: low-power readback: LPM=%s LPMLVL=%s (configured LPM=%u; LPMLVL=1 → Stop1 ~3uA wake-on-UART1)",
                           lpm_val.c_str(), lpmlvl_val.c_str(),
                           static_cast<unsigned>(m_config.lp_mode));
            }
            break;

        case 14:
            // Duty Cycle Setting — compile-time flag LORA_DCS_ENABLE.
            //   1 (default) : RAK3172 enforces EU868 1%/0.1%/10% limits (ETSI legal)
            //   0           : DCS off — test builds only, **illegal in EU deployment**
            // We always set this explicitly so the module does not keep a stale
            // value written by an earlier firmware flash.
            at_error = !send_AT(AT_SET_DCS, std::to_string(LORA_DCS_ENABLE));
            break;

        case 15:
            // Full config done — mark configured. ABP short-circuit: no join,
            // no NJS read needed, so transition straight to idle and skip the
            // two no-op scheduler ticks the common path (case 100 → 101) would
            // cost. Saves ~40 ms on the cold-boot → first-TX critical path
            // for ABP. OTAA still takes the common path to verify join state
            // via AT_GET_NJS / launch joining if needed.
            m_is_configured = true;
            if (m_config.njm == 0) {
                DEBUG_INFO("LoRaDevice: ABP — configure done, going to idle");
                m_joined = true;
                LORA_STATE_CHANGE(configure, idle);
                return;
            }
            m_config_step = 99;  // Will be incremented to 100 (OTAA path)
            break;

        // ==== Common path (runs every boot) ====

        case 100:
            // Config store (LRP01) is the source of truth for DEVEUI — never
            // overwrite it from the module. Bootstrap (empty store) is handled
            // in case 3 for OTAA. ABP keeps whatever the user wrote for later
            // analysis even though it has no LoRaWAN function.
            break;

        case 101:
            // Check join status / initiate join
            if (m_config.njm == 0) {
                DEBUG_INFO("LoRaDevice: ABP mode - no join required");
                m_joined = true;
                LORA_STATE_CHANGE(configure, idle);
                return;
            }
            at_error = !send_AT(AT_GET_NJS);
            if (!at_error && m_lora_comm.m_last_value == "1") {
                DEBUG_INFO("LoRaDevice: already joined from previous session");
                m_joined = true;
                LORA_STATE_CHANGE(configure, idle);
                return;
            }
            LORA_STATE_CHANGE(configure, joining);
            return;

        default:
            LORA_STATE_CHANGE(configure, error);
            return;
    }

    if (at_error)
    {
        DEBUG_ERROR("LoRaDevice::state_configure: failed at step %u (fatal — no internal retry)", m_config_step);
        // Configure failures (bad credentials, module rejecting AT command) do
        // NOT self-heal on retry. Skip the state_error retry loop, notify the
        // service layer immediately, and cut power. The service's global error
        // counter (DEVICE_ERROR_MAX_CONSECUTIVE) is the single source of truth
        // for when to give up.
        m_consecutive_errors = 0;
        notify(KineisEventDeviceError({}));
        LORA_STATE_CHANGE(configure, power_off);
        return;
    }

    m_config_step++;
    // Inter-step delay: 20 ms (was 50 ms). Each step's send_AT() blocks ~50-100 ms
    // already, which is plenty for the scheduler to tick other tasks. The 50 ms
    // gap was a safety margin that costs ~390 ms over the 13 configure steps
    // for nothing measurable. Keep some delay (not 0) so background tasks
    // (BLE, sensors, USB) get airtime between AT round-trips.
    run_state_machine(20);  // Continue configuration
}

void LoRaDevice::state_configure_exit() {
    ;
}

// ========================================================================
// State: joining
//   - Initiate LoRaWAN join procedure
//   - Wait for +EVT:JOINED or +EVT:JOIN FAILED
//   - Timeout after 90 seconds
// ========================================================================

bool LoRaDevice::otaa_credentials_missing() const
{
    // ABP activates from DEVADDR + NWKSKEY + APPSKEY and never uses these two,
    // so it can never be "missing credentials" by this definition.
    return m_config.njm == 1 && (m_config.appeui.empty() || m_config.appkey.empty());
}

bool LoRaDevice::query_join_state()
{
    // AT+NJS=? is a local UART query: no RF, no duty-cycle cost, safe to poll.
    if (!send_AT(AT_GET_NJS))
        return false;
    return m_lora_comm.m_last_value == "1";
}

void LoRaDevice::state_joining_enter()
{
    DEBUG_INFO("LoRaDevice::state_joining_enter: NJM=%u", m_config.njm);

    // ABP mode should never reach here, but handle gracefully
    if (m_config.njm == 0) {
        DEBUG_INFO("LoRaDevice: ABP mode - skipping join");
        m_joined = true;
        return;
    }

    // Refuse to burn a join window with credentials the server cannot possibly
    // accept. With LORA_NJM defaulting to 1 (OTAA) and LORA_APPEUI/LORA_APPKEY
    // both defaulting to "", an unprovisioned unit used to reach here, skip the
    // AT+APPEUI/AT+APPKEY writes silently in configure, and join with whatever
    // keys were left in the module's own flash. The server drops those on MIC
    // and the only symptom is a join that never completes.
    if (otaa_credentials_missing()) {
        DEBUG_ERROR("LoRaDevice: OTAA join refused — LORA_APPEUI(LRP02)=%s LORA_APPKEY(LRP03)=%s; "
                    "provision them (PARMW) then force a write (SATVF force=1)",
                    m_config.appeui.empty() ? "UNSET" : "set",
                    m_config.appkey.empty() ? "UNSET" : "set");
        m_is_error = true;
        return;
    }

