arribada/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
    m_joined = false;
    m_join_failed = false;
    m_is_error = false;
    m_join_wait_ticks = 0;
    // Consume this packet's single join allowance, whoever initiated the join
    // (configure case 101 on a cold dispatch, or the state_idle guard).
    m_join_attempted = true;

    // AT+JOIN=<start>:<auto_join>:<interval>:<attempts>
    // start=1, auto_join=0 (no persistent rejoin on failure — saves battery).
    // Attempt count and interval are unchanged from the previous behaviour, so
    // the RF footprint is identical; only the supervising timeout is corrected.
    const std::string join_args = "1:0:" + std::to_string(JOIN_INTERVAL_S) +
                                  ":" + std::to_string(JOIN_ATTEMPTS);
    if (!send_AT(AT_JOIN, join_args)) {
        // A module still running its previous join cycle answers AT_ERROR /
        // AT_BUSY_ERROR here. That is not a device fault and must not cost an
        // error strike: ask it directly whether it is already joined, and
        // otherwise just keep supervising the cycle it is still running.
        if (query_join_state()) {
            DEBUG_INFO("LoRaDevice: AT+JOIN refused but module reports joined (NJS=1)");
            m_joined = true;
            return;
        }
        DEBUG_WARN("LoRaDevice: AT+JOIN refused (module busy in a previous cycle) — supervising it");
        initiate_timeout(JOIN_WINDOW_MS);
        return;
    }

    DEBUG_INFO("LoRaDevice: join started (%u attempts, %u s apart, window %u s)",
               JOIN_ATTEMPTS, JOIN_INTERVAL_S, JOIN_WINDOW_MS / 1000);
    initiate_timeout(JOIN_WINDOW_MS);
}

void LoRaDevice::state_joining()
{
    m_lora_comm.process_rx();  // Process any ISR-buffered async events

    if (m_joined)
    {
        DEBUG_INFO("LoRaDevice: network joined successfully");
        LORA_STATE_CHANGE(joining, idle);
    }
    else if (m_join_failed || m_is_error)
    {
        // Before declaring failure, ask the module directly. +EVT:JOINED is a
        // single asynchronous line: if the cooperative scheduler was starved
        // while the GNSS receiver streamed (observed: 3.5 min with no LoRa
        // tick), process_rx() was not pumping and the event can be dropped on
        // ISR-buffer overflow — after which the join has actually SUCCEEDED and
        // the firmware would never know. AT+NJS=? is the module's own state and
        // costs no RF, so it is the safer source of truth on this edge.
        if (query_join_state()) {
            DEBUG_WARN("LoRaDevice: join event missed (timeout/error) but module reports joined (NJS=1) — recovering");
            m_joined = true;
            LORA_STATE_CHANGE(joining, idle);
            return;
        }
        DEBUG_ERROR("LoRaDevice: join failed");
        LORA_STATE_CHANGE(joining, error);
    }
    else
    {
        // Still waiting. Poll NJS periodically for the same reason as above:
        // it turns a missed event into at most JOIN_NJS_POLL_TICKS * 500 ms of
        // extra waiting instead of a whole wasted window.
        if (++m_join_wait_ticks >= JOIN_NJS_POLL_TICKS) {
            m_join_wait_ticks = 0;
            if (query_join_state()) {
                DEBUG_INFO("LoRaDevice: joined (detected by NJS poll)");
                m_joined = true;
                LORA_STATE_CHANGE(joining, idle);
                return;
            }
        }
        run_state_machine(500);
    }
}

void LoRaDevice::state_joining_exit()
{
    cancel_timeout();
}

// ========================================================================
// State: idle
//   - Check for pending TX packets
//   - Power off if nothing to send
// ========================================================================

void LoRaDevice::state_idle_enter() {
    ;
}

void LoRaDevice::state_idle()
{
    // Deferred config reload triggered by a PARMW while the FSM was busy.
    // Drop pending packet (if any) since it may have been encoded with stale
    // credentials/keys and re-route through power_off so the next start_device
    // cold-boots through the full configure walk with the new values. The
    // service layer's depth-pile keeps the data; this only sacrifices one TX
    // dispatch to converge on the fresh config.
    if (m_config_reload_pending) {
        DEBUG_INFO("LoRaDevice::state_idle: applying deferred config reload");
        m_config_reload_pending = false;
        if (m_packet_buffer.length()) {
            DEBUG_WARN("LoRaDevice::state_idle: dropping pending packet to apply new config");
            m_packet_buffer.clear();
            notify(KineisEventDeviceError({}));
        }
        LORA_STATE_CHANGE(idle, power_off);
        return;
    }

    if (m_packet_buffer.length()) {
        // OTAA session guard, for the case the module was already up and lost
        // its session: send() is dispatched by the service layer with no
        // knowledge of join state, so the packet would go out as AT+SEND on an
        // unjoined module, fail with AT_NO_NETWORK_JOINED, and burn an error
        // strike for nothing. Re-joining here keeps the packet buffered —
        // state_joining returns to idle on success and this branch transmits it.
        //
        // m_join_attempted caps this at ONE join window per buffered packet,
        // and that bound is load-bearing. state_error sends the FSM back to
        // idle for its first MAX_CONSECUTIVE_ERRORS strikes, and nothing on
        // that path clears m_packet_buffer, so an unbounded guard would re-fire
        // on every strike and turn each one into a fresh 90 s join. Out of
        // gateway coverage — the normal state of a terrestrial tracker between
        // passes — that trades a ~50 ms local rejection for ~270 s of join
        // requests at LORA_TXP=0, every dispatch, for a gateway that isn't
        // there. Battery is priority 2 in this firmware; the guard must not
        // make the no-coverage case expensive to buy back the rare
        // lost-session case.
        //
        // The flag is set by state_joining_enter (so a join already spent by
        // the configure walk counts too) and cleared by send() for each new
        // packet.
        //
        // ABP is unaffected twice over: njm == 0, and the configure walk has
        // already set m_joined (case 15 / case 101).
        if (m_config.njm == 1 && !m_joined && !m_join_attempted) {
            DEBUG_INFO("LoRaDevice::state_idle: TX pending but not joined — re-joining first");
            LORA_STATE_CHANGE(idle, joining);
            return;
        }
        LORA_STATE_CHANGE(idle, transmit);
    } else if (m_config.lp_mode == 1) {
        // Standby: module stays powered. Configured LPMLVL=1 → Stop1
        // (~3 µA per STM32WLE5 datasheet), NOT Stop2 (~1.7 µA): Stop2 cannot
        // wake from UART1 on this PCB — see state_configure step 13 rationale.
        LORA_STATE_CHANGE(idle, standby);
    } else {
        // Shutdown: full power off = 0µA, but 2.5s reboot on next TX
        LORA_STATE_CHANGE(idle, power_off);
    }
}

void LoRaDevice::state_idle_exit() {
    ;
}

// ========================================================================
// State: standby
//   - Module powered, UART initialized, Stop1 LPM active (~3 µA per
//     STM32WLE5 datasheet — Stop2 ~1.7 µA is incompatible with our UART1
//     wake path, so configure pins LPMLVL=1).
//   - RAK3172 auto-sleeps via LPM=1 when no UART activity
//   - Wake on UART RX (any byte wakes the MCU from Stop1 in ~15µs)
//   - Waiting for send() to be called
// ========================================================================

void LoRaDevice::state_standby_enter() {
    // Deinitialize the nRF UARTE1 peripheral while the RAK3172 sleeps in
    // its own Stop1 LPM. Without this, UARTE1 stays clocked and burns
    // ~300-500 µA even when idle — that's the difference between the
    // LoRa board measuring 0.7 mA vs SMD measuring 27 µA.
    //
    // The RAK3172 itself continues to receive power via SAT_PWR_EN so it
    // retains LoRaWAN session state. We only detach the nRF-side UART;
    // the module's internal Stop1 wake-on-UART is still active on its
    // side, but we no longer clock our peripheral while waiting for a
    // send() call from the service layer.
    // Demoted to TRACE: fires on every TX cycle (idle → standby) on the
    // surfacing-burst hot path. LFS commit overhead (~50-300 ms) compounds
    // across burst pings. The transition is observable via the standby_exit
    // INFO log on next TX wake (if needed).
    DEBUG_TRACE("LoRaDevice: standby (RAK Stop1 ~3uA + UARTE1 deinit)");

    // Explicit AT+SLEEP before UART deinit — workaround for AT+LPM=1 not
    // reliably triggering Stop2 auto-sleep on RUI 4.0.6. The continuous-sleep
    // form (no param) wakes on any UART RX byte, which is exactly what
    // start_device() sends to resume from standby (AT ping).
    // Short timeout (200 ms) to avoid blocking the scheduler if the module is
    // already asleep / unresponsive — we're transitioning to standby anyway,
    // a missed OK isn't fatal.
    send_AT(AT_SLEEP_NOW, std::nullopt, 200);

    m_lora_comm.deinit();
    // Re-assert the unused-pin park — defensive in case some other code path
    // reconfigured them between power_on and here.
    lora_park_unused_sat_pins();
}

void LoRaDevice::state_standby() {
    // Nothing to do - module is sleeping, waiting for send() call
}

void LoRaDevice::state_standby_exit() {
    // Re-initialize UARTE1 so we can talk to the RAK3172 again. This is
    // the mirror of state_standby_enter's deinit. The module is still
    // powered (SAT_PWR_EN high), so the first UART byte we send (typically
    // an AT ping from start_device's wake path, or the AT+SEND from
    // state_transmit_enter) will wake it from Stop2 in ~15 µs.
    DEBUG_TRACE("LoRaDevice: standby exit — reinit UART");
    m_lora_comm.init();
}

// ========================================================================
// State: transmit
//   - Send hex payload via AT+SEND=<fport>:<hex_data>
//   - Wait for +EVT:TX_DONE
// ========================================================================

void LoRaDevice::state_transmit_enter()
{
    // Demoted to TRACE: fires on every TX. AT+SEND itself is the canonical
    // marker (visible in module UART traces) and the service-layer log
    // ("process_status_burst" or equivalent) already names the TX.
    DEBUG_TRACE("LoRaDevice::state_transmit_enter");

    m_tx_done = false;
    m_is_error = false;

    // Format: AT+SEND=<port>:<hex_payload>
    std::string send_params = std::to_string(m_config.fport) + ":" + m_packet_buffer;
    if (!send_AT(AT_SEND, send_params)) {
        DEBUG_ERROR("LoRaDevice: AT+SEND command failed");
        m_is_error = true;
        return;
    }

