arribada/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
    // GPS multi is always size-clamped by max_gps_entries(), so it never
    // exceeds the current DR — no contribution to max_packet_bytes.

    // Map byte threshold → min required DR
    uint8_t min_dr = 0;
    if      (max_packet_bytes > 115) min_dr = 4;  // DR4 (222 B)
    else if (max_packet_bytes > 51)  min_dr = 3;  // DR3 (115 B)
    else                             min_dr = 0;  // any DR

    if (m_config.dr < min_dr) {
        DEBUG_WARN("LoRaDevice: max packet %u B requires DR≥%u — bumping LORA_DR %u → %u",
                   max_packet_bytes, min_dr, m_config.dr, min_dr);
        m_config.dr = min_dr;
    }

    DEBUG_INFO("LoRaDevice: config NJM=%u BAND=%u DR=%u ADR=%u TXP=%u CFM=%u FPORT=%u CLASS=%c LP=%u",
               m_config.njm, m_config.band, m_config.dr, m_config.adr,
               m_config.txp, m_config.cfm, m_config.fport, m_config.device_class, m_config.lp_mode);
    if (!m_config.deveui.empty())
        DEBUG_INFO("LoRaDevice: DEVEUI=%s", m_config.deveui.c_str());
    if (!m_config.appeui.empty())
        DEBUG_INFO("LoRaDevice: APPEUI=%s", m_config.appeui.c_str());
}

/// @brief Re-read LoRa config from store and detect drift vs cached `m_config`.
/// On drift: invalidate the "already configured" fast path, raise the deferred
/// reload flag, and (if the FSM is currently parked) trigger a power_off so the
/// next start_device walks the full configure chain with fresh values.
///
/// Busy states (transmit/joining/configure/power_on/error) are left alone — the
/// flag is consumed at the next idle entry. This guarantees we never abort an
/// in-flight TX or Join just because a PARMW was issued.
bool LoRaDevice::reload_config_if_changed()
{
    LoRaConfig old_cfg = m_config;
    load_config_from_store();

    bool changed =
        (old_cfg.deveui       != m_config.deveui)       ||
        (old_cfg.appeui       != m_config.appeui)       ||
        (old_cfg.appkey       != m_config.appkey)       ||
        (old_cfg.devaddr      != m_config.devaddr)      ||
        (old_cfg.appskey      != m_config.appskey)      ||
        (old_cfg.nwkskey      != m_config.nwkskey)      ||
        (old_cfg.njm          != m_config.njm)          ||
        (old_cfg.band         != m_config.band)         ||
        (old_cfg.dr           != m_config.dr)           ||
        (old_cfg.adr          != m_config.adr)          ||
        (old_cfg.txp          != m_config.txp)          ||
        (old_cfg.cfm          != m_config.cfm)          ||
        (old_cfg.fport        != m_config.fport)        ||
        (old_cfg.lp_mode      != m_config.lp_mode)      ||
        (old_cfg.device_class != m_config.device_class);

    if (!changed)
        return false;

    DEBUG_INFO("LoRaDevice::reload_config_if_changed: LoRa config drift detected, scheduling reconfigure");
    m_is_configured        = false;  // Force full configure walk on next entry
    m_config_reload_pending = true;

    // Bridge mode (LORABR=1) gives the host direct UART access to the RAK3172.
    // Calling power_off_immediate() would deinit UARTE1 and kill the bridge
    // mid-session — definitely not what the user wants while typing AT
    // commands in a terminal. Defer; stop_bridge() → run_state_machine() will
    // hit state_idle which consumes the flag cleanly.
    if (m_bridge_active) {
        DEBUG_INFO("LoRaDevice::reload_config_if_changed: bridge active, deferring apply");
        return true;
    }

    // Apply immediately if FSM is parked. For busy states (transmit/joining/
    // configure/power_on/error), state_idle will catch the flag on the way back.
    if (m_state == State::idle || m_state == State::standby || m_state == State::power_off) {
        DEBUG_TRACE("LoRaDevice::reload_config_if_changed: applying now (state=%u)", static_cast<unsigned>(m_state));
        power_off_immediate();
        m_config_reload_pending = false;  // Next start_device() cold-boots → full configure
    }
    return true;
}

/// @brief Read LoRa credentials from RAK3172 module via AT commands.
/// Module must be powered on (idle/standby/configure state).
LoRaDevice::LoRaCredentials LoRaDevice::read_lora_credentials()
{
    LoRaCredentials creds;
    creds.read_ok = false;

    // Auto-wake: if the module is off (LORA_LP_MODE=0 shutdown, or
    // LORA_POWER_OFF_UNDERWATER during a dive), boot it up just for this read.
    // Restore to power_off on exit so the caller's idle state is preserved.
    bool was_off = (m_state == State::power_off);
    if (!ensure_module_awake()) {
        DEBUG_ERROR("LoRaDevice::read_lora_credentials: module wake-up failed");
        return creds;
    }

    // Read NJM — defensive parse: only accept "0" or "1", anything else is
    // likely leftover banner/noise that slipped past the comm filter.
    if (send_AT(AT_GET_NJM)) {
        const std::string& v = m_lora_comm.m_last_value;
        if (v == "0") creds.njm = 0;
        else if (v == "1") creds.njm = 1;
        else {
            DEBUG_WARN("LoRaDevice::read_lora_credentials: unexpected NJM value '%s' — treating as read failure", v.c_str());
            if (was_off) power_off_immediate();
            return creds;
        }
    } else {
        DEBUG_WARN("LoRaDevice::read_lora_credentials: failed to read NJM");
        if (was_off) power_off_immediate();
        return creds;
    }

    // Read DEVEUI
    if (send_AT(AT_GET_DEVEUI)) {
        creds.deveui = m_lora_comm.m_last_value;
    }

    if (creds.njm == 1) {
        // OTAA: read APPEUI + APPKEY
        if (send_AT(AT_GET_APPEUI)) {
            creds.appeui = m_lora_comm.m_last_value;
        }
        if (send_AT(AT_GET_APPKEY)) {
            creds.appkey = m_lora_comm.m_last_value;
        }
    } else {
        // ABP: read DEVADDR (NWKSKEY/APPSKEY are write-only on RAK3172)
        if (send_AT(AT_GET_DEVADDR)) {
            creds.devaddr = m_lora_comm.m_last_value;
        }
    }

    creds.read_ok = true;

    if (was_off) {
        DEBUG_TRACE("LoRaDevice::read_lora_credentials: restoring power-off");
        power_off_immediate();
    }
    return creds;
}

/// @brief Write LoRa credentials from the config store to the RAK3172 module.
/// Module must be powered on (idle/standby/configure state). Caller must reload
/// the module config (e.g. via read_lora_credentials()) afterwards to refresh cache.
/// @note Changing NJM triggers a RAK3172 reboot; subsequent AT writes in the same
///       call will fail. Callers should only change NJM outside this path or
///       re-invoke after the reboot completes.
bool LoRaDevice::write_credentials_from_config()
{
    bool was_off = (m_state == State::power_off);
    if (!ensure_module_awake()) {
        DEBUG_ERROR("LoRaDevice::write_credentials_from_config: wake-up failed");
        return false;
    }

    // Capture the module's CURRENT NJM before we overwrite it. AT+SET_NJM
    // triggers a RAK3172 software reboot when the value actually changes;
    // any AT writes issued in that ~2 s window are silently dropped (no
    // response, banner printed, etc.). Detect-then-pause avoids the cascade
    // of "DEVADDR not set / no network joined" failures previously observed
    // when switching OTAA ↔ ABP from SATVF=1.
    uint8_t module_njm = 0xFF;  // 0xFF = unknown / no readback
    if (send_AT(AT_GET_NJM)) {
        const std::string& v = m_lora_comm.m_last_value;
        if      (v == "0") module_njm = 0;
        else if (v == "1") module_njm = 1;
    }

    // Load latest values from config store into m_config (keeps local cache coherent)
    load_config_from_store();
    DEBUG_INFO("write_credentials: njm=%u deveui='%s' (len=%u) devaddr='%s' (len=%u) "
               "appeui_len=%u appkey_len=%u nwkskey_len=%u appskey_len=%u",
               m_config.njm,
               m_config.deveui.c_str(),  static_cast<unsigned>(m_config.deveui.size()),
               m_config.devaddr.c_str(), static_cast<unsigned>(m_config.devaddr.size()),
               static_cast<unsigned>(m_config.appeui.size()),
               static_cast<unsigned>(m_config.appkey.size()),
               static_cast<unsigned>(m_config.nwkskey.size()),
               static_cast<unsigned>(m_config.appskey.size()));

    bool njm_changing = (module_njm != 0xFF && module_njm != m_config.njm);

    // Set join mode first — module may reboot if NJM changes
    DEBUG_TRACE("write_credentials: step NJM");
    if (!send_AT(AT_SET_NJM, std::to_string(m_config.njm))) {
        DEBUG_ERROR("write_credentials: AT_SET_NJM failed");
        return false;
    }

    // If NJM actually changed, the RAK3172 is rebooting right now. Wait for
    // the boot to complete (~2 s typical, give 3 s margin), drain the boot
    // banner so it does not pollute the next response, and re-probe with
    // AT to confirm the module is responsive again BEFORE writing any
    // credentials. Without this, the credential writes that follow vanish
    // into the UART void and leave the module in a broken half-provisioned
    // state.
    if (njm_changing) {
        DEBUG_INFO("write_credentials: NJM changed (%u → %u), waiting for module reboot",
                   module_njm, m_config.njm);
        PMU::delay_ms(3000);
        m_lora_comm.process_rx();  // drain boot banner
        if (!send_AT(AT_TEST)) {
            DEBUG_ERROR("write_credentials: module not responsive after NJM-triggered reboot");
            return false;
        }
    }

