arribada/linkit-v4-core/ports/nrf52840/core/hardware/lora_rak3172/lora_rak3172.cpp
    // DEVEUI: OTAA only. ABP activation uses DEVADDR + session keys; writing
    // DEVEUI in ABP triggers RAK3172 PARAM_ERROR type=2 in some states.
    if (m_config.njm == 1 &&
        !m_config.deveui.empty() && m_config.deveui != "0000000000000000") {
        if (m_config.deveui.size() != 16) {
            DEBUG_ERROR("write_credentials: invalid DEVEUI length %u",
                        static_cast<unsigned>(m_config.deveui.size()));
            return false;
        }
        DEBUG_TRACE("write_credentials: step DEVEUI");
        if (!send_AT(AT_SET_DEVEUI, m_config.deveui)) {
            DEBUG_ERROR("write_credentials: AT_SET_DEVEUI failed");
            return false;
        }
    } else if (m_config.njm == 0) {
        DEBUG_TRACE("write_credentials: ABP mode — skipping DEVEUI");
    }

    if (m_config.njm == 1) {
        // OTAA: APPEUI + APPKEY. This is the SATVF force=1 path, i.e. an
        // operator explicitly asking "push my credentials to the module". It
        // used to skip an unset key silently and still report success, so the
        // operator had no way to tell a real write from a no-op. Report both
        // outcomes at a level that survives DEBUG_LEVEL=3.
        if (m_config.appeui.empty()) {
            DEBUG_ERROR("write_credentials: LORA_APPEUI (LRP02) UNSET — NOT written, module keeps its stored JoinEUI");
        } else {
            if (m_config.appeui.size() != 16) {
                DEBUG_ERROR("write_credentials: invalid APPEUI length %u",
                            static_cast<unsigned>(m_config.appeui.size()));
                return false;
            }
            if (!send_AT(AT_SET_APPEUI, m_config.appeui)) {
                DEBUG_ERROR("write_credentials: AT_SET_APPEUI failed");
                return false;
            }
            DEBUG_INFO("write_credentials: APPEUI written (%s)", m_config.appeui.c_str());
        }
        if (m_config.appkey.empty()) {
            DEBUG_ERROR("write_credentials: LORA_APPKEY (LRP03) UNSET — NOT written, module keeps its stored AppKey");
        } else {
            if (m_config.appkey.size() != 32) {
                DEBUG_ERROR("write_credentials: invalid APPKEY length %u",
                            static_cast<unsigned>(m_config.appkey.size()));
                return false;
            }
            if (!send_AT(AT_SET_APPKEY, m_config.appkey)) {
                DEBUG_ERROR("write_credentials: AT_SET_APPKEY failed");
                return false;
            }
            DEBUG_INFO("write_credentials: APPKEY written (32 hex chars, not logged)");
        }
    } else {
        // ABP: DEVADDR + NWKSKEY + APPSKEY all required for a functional session.
        // (Previously only DEVADDR was written — session keys were skipped with a
        // misleading "write-only" comment. They ARE write-only at the RAK3172 read
        // side but MUST be written for ABP activation.)
        if (!m_config.devaddr.empty()) {
            if (m_config.devaddr.size() != 8) {
                DEBUG_ERROR("write_credentials: invalid DEVADDR length %u",
                            static_cast<unsigned>(m_config.devaddr.size()));
                return false;
            }
            DEBUG_TRACE("write_credentials: step DEVADDR");
            if (!send_AT(AT_SET_DEVADDR, m_config.devaddr)) {
                DEBUG_ERROR("write_credentials: AT_SET_DEVADDR failed");
                return false;
            }
        }
        if (!m_config.nwkskey.empty()) {
            if (m_config.nwkskey.size() != 32) {
                DEBUG_ERROR("write_credentials: invalid NWKSKEY length %u",
                            static_cast<unsigned>(m_config.nwkskey.size()));
                return false;
            }
            DEBUG_TRACE("write_credentials: step NWKSKEY");
            if (!send_AT(AT_SET_NWKSKEY, m_config.nwkskey)) {
                DEBUG_ERROR("write_credentials: AT_SET_NWKSKEY failed");
                return false;
            }
        }
        if (!m_config.appskey.empty()) {
            if (m_config.appskey.size() != 32) {
                DEBUG_ERROR("write_credentials: invalid APPSKEY length %u",
                            static_cast<unsigned>(m_config.appskey.size()));
                return false;
            }
            DEBUG_TRACE("write_credentials: step APPSKEY");
            if (!send_AT(AT_SET_APPSKEY, m_config.appskey)) {
                DEBUG_ERROR("write_credentials: AT_SET_APPSKEY failed");
                return false;
            }
        }
    }

    DEBUG_INFO("write_credentials: credentials written OK (njm=%u)", m_config.njm);

    // Credentials just changed → the cached "module already configured"
    // shortcut is no longer valid, and any prior OTAA session is dead.
    // Force the FSM to walk the full configure chain on its next entry, and
    // re-Join in OTAA. Without this, the driver would AT+SEND with stale
    // session keys and rely on the state_error path to recover (1-2 lost
    // dispatches per credential change).
    m_is_configured = false;
    if (m_config.njm == 1) {
        m_joined = false;
    }

    if (was_off) {
        DEBUG_TRACE("LoRaDevice::write_credentials_from_config: restoring power-off");
        power_off_immediate();
        // power_off_immediate already resets the cycle; next start_device
        // walks power_on → configure(full) → joining (OTAA) cleanly.
    } else {
        // Module is still on (caller had it awake). Mark the deferred reload
        // so the next idle entry forces a power-cycle and clean reconfigure.
        m_config_reload_pending = true;
    }
    return true;
}

/// @brief Start RF Continuous Wave on the RAK3172 (AT+CW=freq,pwr,duration).
/// Auto-wakes if needed — CW is a test command so we do NOT restore power-off
/// afterwards: the CW itself takes over the radio for its `duration_s` window,
/// and the caller typically pairs with cw_stop (ATZ) which brings the driver
/// back to power_off anyway.
bool LoRaDevice::cw_start(uint32_t freq_hz, uint16_t power_dbm, uint16_t duration_s)
{
    if (!ensure_module_awake()) {
        DEBUG_WARN("LoRaDevice::cw_start: module wake-up failed");
        return false;
    }
    if (duration_s == 0) duration_s = 60;   // RUI3 requires a duration
    std::string params = std::to_string(freq_hz) + "," +
                         std::to_string(power_dbm) + "," +
                         std::to_string(duration_s);
    DEBUG_INFO("LoRaDevice::cw_start: %s", params.c_str());
    return send_AT(AT_SET_CW, params);
}

/// @brief Stop CW — RUI3 does not expose AT+CW stop; issue ATZ. The module
/// resets without sending "OK", so we dispatch the write without waiting and
/// force our own state machine back to power_off. The next send() will bring
/// the module up cleanly via the normal configure path.
bool LoRaDevice::cw_stop()
{
    DEBUG_INFO("LoRaDevice::cw_stop (ATZ reset)");
    if (m_state == State::power_off) return true;  // Already stopped

